dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/FLASHCTL_1.0.xml
    <register id="FLASHCTL_CMDDATA18" width="32" offset="0x1178" description="Command Data Register 18">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA19" width="32" offset="0x117C" description="Command Data Register 19">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA20" width="32" offset="0x1180" description="Command Data Register 20">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA21" width="32" offset="0x1184" description="Command Data Register 21">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA22" width="32" offset="0x1188" description="Command Data Register 22">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA23" width="32" offset="0x118C" description="Command Data Register 23">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA24" width="32" offset="0x1190" description="Command Data Register 24">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA25" width="32" offset="0x1194" description="Command Data Register 25">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA26" width="32" offset="0x1198" description="Command Data Register 26">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA27" width="32" offset="0x119C" description="Command Data Register 27">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA28" width="32" offset="0x11A0" description="Command Data Register 28">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA29" width="32" offset="0x11A4" description="Command Data Register 29">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA30" width="32" offset="0x11A8" description="Command Data Register 30">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA31" width="32" offset="0x11AC" description="Command Data Register 31">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
